In [ ]:
thislist=["orange","mango","kiwi","pineapple","banana"]
print(thislist)

['orange', 'mango', 'kiwi', 'pineapple', 'banana']

In [ ]:
thislist=["orange","mango","kiwi","pineapple","banana"]
thislist.sort()
print(thislist)

['banana', 'kiwi', 'mango', 'orange', 'pineapple']

In [ ]:
thislist=[100,40,50,2,22,83,78]
thislist.sort()
print(thislist)

[2, 22, 40, 50, 78, 83, 100]

In [ ]:
thislist=["orange","mango","kiwi","pineapple","banana"]
thislist.sort(reverse=True)
print(thislist)

['pineapple', 'orange', 'mango', 'kiwi', 'banana']

In [ ]:
thislist=[100,40,50,2,22,83,78]
thislist.sort(reverse=True)
print(thislist)

[100, 83, 78, 50, 40, 22, 2]

In [ ]:
thislist=["orange","mango","kiwi","pineapple","banana"]
newlist=thislist.copy()
print(newlist)

['orange', 'mango', 'kiwi', 'pineapple', 'banana']

In [ ]:
thislist=[100,40,50,2,22,83,78]
newlist=thislist.copy()
print(newlist)

[100, 40, 50, 2, 22, 83, 78]

In [ ]:
list1=["orange","mango","kiwi","pineapple","banana"]
list2=[100,40,50,2,22,83,78]
list3=list1+list2
print(list3)

['orange', 'mango', 'kiwi', 'pineapple', 'banana', 100, 40, 50, 2, 22, 83, 78]

In [ ]:
list1=["orange","mango","kiwi","pineapple","banana"]
list2=[100,40,50,2,22,83,78]
for x in list2:
  list1.append(x)
print(list1)

['orange', 'mango', 'kiwi', 'pineapple', 'banana', 100, 40, 50, 2, 22, 83, 78]

In [ ]:
list1=["orange","mango","kiwi","pineapple","banana"]
list2=[100,40,50,2,22,83,78]
list1.extend(list2)
print(list1)

['orange', 'mango', 'kiwi', 'pineapple', 'banana', 100, 40, 50, 2, 22, 83, 78]

In [ ]:
list1=["orange","mango","kiwi","pineapple","banana"]
#******

In [ ]:
thistuple=("apple","banana","cherry")
print(thistuple)

('apple', 'banana', 'cherry')

In [ ]:
thistuple=("apple","banana","cherry","apple","banana","cherry")
print(thistuple)

('apple', 'banana', 'cherry', 'apple', 'banana', 'cherry')

In [ ]:
thistuple=("apple","banana","cherry","apple","banana","cherry")
print(len(thistuple))

6

In [ ]:
tuple1=["orange","mango","kiwi","pineapple","banana"]
tuple2=[100,40,50,2,22,83,78]
tuple3=(True,False,False)
print(tuple1)
print(tuple2)
print(tuple3)

['orange', 'mango', 'kiwi', 'pineapple', 'banana']
[100, 40, 50, 2, 22, 83, 78]
(True, False, False)

In [ ]:
tuple1=("orange",23,"pineapple","banana",True,"34")
print(tuple3)

(True, False, False)

In [ ]:
tuple1=("orange",23,"pineapple","banana",True,"34")
print(tuple1)

('orange', 23, 'pineapple', 'banana', True, '34')

In [ ]:
tuple1=("orange",23,"pineapple","banana",True,"34")
print(tuple1)
print(type(tuple1))

('orange', 23, 'pineapple', 'banana', True, '34')
<class 'tuple'>

In [ ]:
tuple1=("orange",23,"pineapple","banana",True,"34")
print(tuple1[4])

True

In [ ]:
tuple2=("orange",23,"pineapple","banana",True,"34")
print(tuple1[-2])

True

In [ ]:
tuple2=("orange",23,"pineapple","banana",True,"34")
print(tuple1[:4])

('orange', 23, 'pineapple', 'banana')

In [ ]:
tuple2=("orange",23,"pineapple","banana",True,"34")
print(tuple1[2:])

('pineapple', 'banana', True, '34')

In [ ]:
x=("apple","banana","cherry")
y=list(x)
y[1]="kiwi"
x=tuple(y)
print(x)

('apple', 'kiwi', 'cherry')

In [ ]:
thistuple=("apple","banana","cherry")
y=list(thistuple)
y.append("orange")
thistuple=tuple(y)
print(thistuple)

('apple', 'banana', 'cherry', 'orange')

In [ ]:
thistuple=("apple","banana","cherry")
y=list(thistuple)
y.remove("banana")
thistuple=tuple(y)
print(thistuple)

('apple', 'cherry')

In [ ]:
thistuple=("apple","banana","cherry")

In [ ]:
fruits=("apple","banana","cherry")
(green,yellow,red)=fruits
print(green)
print(yellow)
print(red)

apple
banana
cherry

In [ ]:
fruits=("apple","banana","cherry","orange","mango")
(green,yellow,*red)=fruits
print(green)
print(yellow)
print(red)

apple
banana
['cherry', 'orange', 'mango']

In [ ]:
fruits=("apple","banana","cherry","orange","mango")
for x in fruits:
  print(x)

apple
banana
cherry
orange
mango

In [ ]:
fruits=("apple","banana","cherry","orange","mango")
for i in range(len(fruits)):
  print(fruits[i])

apple
banana
cherry
orange
mango

concatenation , merge and joning Data Frames in Pandas

In [ ]:
import pandas as pd
df1=pd.DataFrame({'Item':['A','B','C','D'],
                  'value':[1,2,3,5]})
df2=pd.DataFrame({'Item':['E','F','G','H'],
                  'value':[6,7,8,9]})
print(df1)
print(df2)

  Item  value
0    A      1
1    B      2
2    C      3
3    D      5
  Item  value
0    E      6
1    F      7
2    G      8
3    H      9

In [ ]:
df1

  Item  value
0    A      1
1    B      2
2    C      3
3    D      5

In [ ]:
df2

  Item  value
0    E      6
1    F      7
2    G      8
3    H      9

In [ ]:
pd.concat([df1,df2])

  Item  value
0    A      1
1    B      2
2    C      3
3    D      5
0    E      6
1    F      7
2    G      8
3    H      9

In [ ]:
import pandas as pd
df1=pd.DataFrame({'Item':['A','B','C','D'],
                  'value':[1,2,3,5]})
df2=pd.DataFrame({'Item':['E','F','G','H'],
                  'value':[5,6,7,8]})
pd.concat([df1,df2])

  Item  value
0    A      1
1    B      2
2    C      3
3    D      5
0    E      5
1    F      6
2    G      7
3    H      8

In [ ]:
import pandas as pd
df1=pd.DataFrame({'Item':['A','B','C','D'],
                  'value':[1,2,3,5]})
df2=pd.DataFrame({'Item':['E','F','G','H'],
                  'Quantity':[5,6,7,8]})
pd.concat([df1,df2])

  Item  value  Quantity
0    A    1.0       NaN
1    B    2.0       NaN
2    C    3.0       NaN
3    D    5.0       NaN
0    E    NaN       5.0
1    F    NaN       6.0
2    G    NaN       7.0
3    H    NaN       8.0

In [ ]:
import pandas as pd
df1=pd.DataFrame({'Item':['A','B','C','D'],
                  'value':[1,2,3,5]})
df2=pd.DataFrame({'Item':['E','F','G','H'],
                  'Quantity':[5,6,7,8]})
pd.concat([df1,df2]).reset_index()

   index Item  value  Quantity
0      0    A    1.0       NaN
1      1    B    2.0       NaN
2      2    C    3.0       NaN
3      3    D    5.0       NaN
4      0    E    NaN       5.0
5      1    F    NaN       6.0
6      2    G    NaN       7.0
7      3    H    NaN       8.0

In [ ]:
pd.concat([df1,df2],axis=1)

  Item  value Item  Quantity
0    A      1    E         5
1    B      2    F         6
2    C      3    G         7
3    D      5    H         8

**Use Append to add multiple DataFrames to another**

In [ ]:
import pandas as pd
df1=pd.DataFrame({'Item':['A','B','C','D'],
                  'value':[1,2,3,5]})
df2=pd.DataFrame({'Item':['E','F','G','H'],
                  'Quantity':[5,6,7,8]})
df3=pd.DataFrame({'Item':['I','J','K','L'],
                  'Quantity':[3,7,4,25]})
df1.append([df2,df3])

  Item  value  Quantity
0    A    1.0       NaN
1    B    2.0       NaN
2    C    3.0       NaN
3    D    5.0       NaN
0    E    NaN       5.0
1    F    NaN       6.0
2    G    NaN       7.0
3    H    NaN       8.0
0    I    NaN       3.0
1    J    NaN       7.0
2    K    NaN       4.0
3    L    NaN      25.0

In [ ]:
import pandas as pd
dfA=pd.DataFrame({'Key':['A','B','C','D'],
                  'A':[1,2,3,5]})
dfB=pd.DataFrame({'Key':['E','F','G','H'],
                  'B':[5,6,7,8]})
pd.merge(dfA,dfB, on='Key')

Empty DataFrame
Columns: [Key, A, B]
Index: []

In [ ]:
import pandas as pd
dfA=pd.DataFrame({'Key':['K0','K1','K2','K3'],
                  'A':  ['A0','A1','A2','A3'],
                  'B':  ['B0','B1','B2','B3']})
dfB=pd.DataFrame({'Key':['K0','K1','K2','K3'],
                  'C':  ['C0','C1','C2','C3'],
                  'D':  ['D0','D1','D2','D3']})
pd.merge(dfA,dfB, on='Key')

  Key   A   B   C   D
0  K0  A0  B0  C0  D0
1  K1  A1  B1  C1  D1
2  K2  A2  B2  C2  D2
3  K3  A3  B3  C3  D3

In [ ]:
import pandas as pd
dfA=pd.DataFrame({'Key':['K0','K1','K2','K3'],
                  'A':  ['A0','A1','A2','A3'],
                  'B':  ['B0','B1','B2','B3']})
dfB=pd.DataFrame({'Key':['K0','K1','K2','K3'],
                  'C':  ['C0','C1','C2','C3'],
                  'D':  ['D0','D1','D2','D3']})
pd.merge(dfA,dfB, how='left', on='Key')

  Key   A   B   C   D
0  K0  A0  B0  C0  D0
1  K1  A1  B1  C1  D1
2  K2  A2  B2  C2  D2
3  K3  A3  B3  C3  D3

In [ ]:
import pandas as pd
dfA=pd.DataFrame({'Key':['K0','K1','K2','K3'],
                  'A':  ['A0','A1','A2','A3'],
                  'B':  ['B0','B1','B2','B3']})
dfB=pd.DataFrame({'Key':['K0','K1','K2','K3'],
                  'C':  ['C0','C1','C2','C3'],
                  'D':  ['D0','D1','D2','D3']})
pd.merge(dfA,dfB,how='right', on='Key')

  Key   A   B   C   D
0  K0  A0  B0  C0  D0
1  K1  A1  B1  C1  D1
2  K2  A2  B2  C2  D2
3  K3  A3  B3  C3  D3

In [ ]:
import pandas as pd
dfA=pd.DataFrame({'Key':['K0','K1','K2','K3'],
                  'A':  ['A0','A1','A2','A3'],
                  'B':  ['B0','B1','B2','B3']})
dfB=pd.DataFrame({'Key':['K0','K1','K2','K3'],
                  'C':  ['C0','C1','C2','C3'],
                  'D':  ['D0','D1','D2','D3']})
pd.merge(dfA,dfB,how='inner', on='Key')

  Key   A   B   C   D
0  K0  A0  B0  C0  D0
1  K1  A1  B1  C1  D1
2  K2  A2  B2  C2  D2
3  K3  A3  B3  C3  D3

### **Joining**

In [ ]:
left=pd.DataFrame({'A':['K0','K1','K2'],
                   'B':['A0','A1','A2']},
                  index=['B0','B1','B2'])

In [ ]:
left

     A   B
B0  K0  A0
B1  K1  A1
B2  K2  A2

In [ ]:
right=pd.DataFrame({'A':['K0','K1','K2'],
                   'B':['A0','A1','A2']},
                  index=['B2','B1','B0'])

In [ ]:
right

     A   B
B2  K0  A0
B1  K1  A1
B0  K2  A2

In [ ]:
left=pd.DataFrame({'A':['A0','A1','A2'],
                   'B':['B0','B1','B2']},
                  index=['K0','K1','K2'])
left

     A   B
K0  A0  B0
K1  A1  B1
K2  A2  B2

In [ ]:
right=pd.DataFrame({'C':['C0','C1','C2'],
                   'D':['D0','D1','D2']},
                  index=['K0','K1','K2'])
right

     C   D
K0  C0  D0
K1  C1  D1
K2  C2  D2

In [ ]:
left.join(right)

     A   B   C   D
K0  A0  B0  C0  D0
K1  A1  B1  C1  D1
K2  A2  B2  C2  D2

In [ ]:
left.join(right,how='outer')

     A   B   C   D
K0  A0  B0  C0  D0
K1  A1  B1  C1  D1
K2  A2  B2  C2  D2

In [ ]:
# Python program for finding H.C.F of two input numbers

def computeHCF(X,Y):

# choose the smaller number
    if X>Y:
      smaller = Y
    else:
      smaller = X
    for i in range(1, smaller+1):
       if ((X % i == 0) and (Y % i == 0)):
         hcf=i

    return hcf

num1=54
num2=24

In [ ]:
# Python program for finding H.C.F of two input numbers

def computeHCF(X,Y):

# choose the smaller number
    if X>Y:
      smaller = Y
    else:
      smaller = X
    for i in range(1, smaller+1):
       if ((X % i == 0) and (Y % i == 0)):
         hcf=i

    return hcf

num1=int(input("Enter first number"))
num2=int(input("Enter second number"))

print("The H.C.F of ",num1,"and",num2,"is", computeHCF(num1,num2))

Enter first number54
Enter second number24
The H.C.F of  54 and 24 is 6

### Python Dictionaries

In [ ]:
thisdict = {
    "Brand": "Ford",
    "Model":"Mustang",
    "Year" : 1964
}
print(thisdict)

{'Brand': 'Ford', 'Model': 'Mustang', 'Year': 1964}

In [ ]:
thisdict = {
    "Brand": "Ford",
    "Model":"Mustang",
    "Year" : 1964,
    "Country": "India"
}
print(thisdict["Year"])

1964

In [ ]:
thisdict = {
    "Brand": "Ford",
    "Model":"Mustang",
    "Year" : 1964,
    "Country": "India"
}
print(thisdict)

{'Brand': 'Ford', 'Model': 'Mustang', 'Year': 1964, 'Country': 'India'}

In [ ]:
thisdict = {
    "Brand": "Ford",
    "Model":"Mustang",
    "Year" : 1964,
    "Country": "India"
}
print(thisdict["Model"])

Mustang

In [ ]:
thisdict = {
    "Brand": "Ford",
    "Model":"Mustang",
    "Year" : 1964,
    "Country": "India",
    "Year" : 2020
}
print(thisdict["Year"])

2020

In [ ]:
print(len(thisdict))

4

In [ ]:
thisdict = {
    "Brand": "Ford",
    "Model":"Mustang",
    "Country": "India",
    "Year" : 2020
}
print(thisdict["Year"])

2020

In [ ]:
print(len(thisdict))

4

In [ ]:
thisdict = {
    "Brand": "Ford",
    "Model":"Mustang",
    "Country": "India",
    "Year" : 1978,
    "colors" :["Red","White","Blue"] 
}
print(thisdict)

{'Brand': 'Ford', 'Model': 'Mustang', 'Country': 'India', 'Year': 1978, 'colors': ['Red', 'White', 'Blue']}

In [ ]:
thisdict = {
    "Brand": "Ford",
    "Model":"Mustang",
    "Country": "India",
    "Year" : 1978,
    "colors" :["Red","White","Blue"] 
}
print(type(thisdict))

<class 'dict'>

In [ ]:
thisdict = {
    "Brand": "Ford",
    "Model":"Mustang",
    "Country": "India",
    "Year" : 1978,
    "colors" :["Red","White","Blue"] 
}
thisdict["Year"] = 2020
print(thisdict)

{'Brand': 'Ford', 'Model': 'Mustang', 'Country': 'India', 'Year': 2020, 'colors': ['Red', 'White', 'Blue']}

In [ ]:
thisdict = {
    "Brand": "Ford",
    "Model":"Mustang",
    "Country": "India",
    "Year" : 2022,
    "colors" :["Red","White","Blue"] 
}
thisdict.update({"Varshitha":"First owner"})
print(thisdict)

{'Brand': 'Ford', 'Model': 'Mustang', 'Country': 'India', 'Year': 2022, 'colors': ['Red', 'White', 'Blue'], 'Varshitha': 'First owner'}

In [ ]:
thisdict = {
    "Brand": "Ford",
    "Model":"Mustang",
    "Country": "India",
    "Year" : 2022,
    "colors" :["Red","White","Blue"] 
}
thisdict.pop("colors")
print(thisdict)

{'Brand': 'Ford', 'Model': 'Mustang', 'Country': 'India', 'Year': 2022}

In [ ]:
thisdict = {
    "Brand": "Ford",
    "Model":"Mustang",
    "Country": "India",
    "Year" : 2022,
    "colors" :["Red","White","Blue"] 
}
del thisdict["Model"]
print(thisdict)

{'Brand': 'Ford', 'Country': 'India', 'Year': 2022, 'colors': ['Red', 'White', 'Blue']}

In [ ]:
thisdict = {
    "Brand": "Ford",
    "Model":"Mustang",
    "Country": "India",
    "Year" : 2022,
    "colors" :["Red","White","Blue"] 
}
thisdict.clear()
print(thisdict)

{}

In [ ]:
thisdict = {
    "Brand": "Ford",
    "Model":"Mustang",
    "Country": "India",
    "Year" : 2022,
    "colors" :["Red","White","Blue"] 
}
Newdict = thisdict.copy()
print(Newdict)

{'Brand': 'Ford', 'Model': 'Mustang', 'Country': 'India', 'Year': 2022, 'colors': ['Red', 'White', 'Blue']}

In [ ]:
thisdict = {
    "child1":{
        "Name" : "Thanusha",
        "Year" : 2014
    },
    "child2":{
        "Name" : "Varshitha",
        "Year" : 2001
    },
    "child3":{
        "Name" : "Abhi",
        "Year" : 2002   
    } 
}
print(thisdict)

{'child1': {'Name': 'Thanusha', 'Year': 2014}, 'child2': {'Name': 'Varshitha', 'Year': 2001}, 'child3': {'Name': 'Abhi', 'Year': 2002}}

In [ ]:
a=33
b=200
if b>a:
  print("b is greater than a")

b is greater than a

In [ ]:
a=33
b=33
if b>a:
  print("b is greater than a")
elif a==b:
  print("a and b are equal")

a and b are equal

In [ ]:
a=330
b=33
if b>a:
  print("b is greater than a")
elif a==b:
  print("a and b are equal")  
else:
  print("a is greater than b")

a is greater than b

In [ ]:
a=330
b=33
if b>a:
  print("b is greater than a")
else:
  print("a is greater than b")

a is greater than b

In [ ]:
a=330
b=3345
if b>a:print("b is greater than a")

b is greater than a

In [ ]:
a=330
b=33
c=350
if a>b and c>a:
  print("both conditions are true")

both conditions are true

In [ ]:
a=330
b=33
c=350
if a>b and c>a:
  print("Atleast one of the conditions is true")

Atleast one of the conditions is true

# **Nested IF**

In [ ]:
x=41

if x>10:
  print("It is above the value 10")
  if x>20:
    print("It is above the value 20")
else :
  print("Not above 20")

It is above the value 10
It is above the value 20

In [ ]:
#while Loop
i=1
while i<6:
   print(i)
   i+=1

1
2
3
4
5

In [ ]:
#while Loop
i=1
while i<6:
   print(i)
   if (i==3):
     break
   i+=1

1
2
3

In [ ]:
#while Loop
i=1
while i<6:
   print(i)
   i+=1
else:
  print("i is no longer less than 6")

1
2
3
4
5
i is no longer less than 6

In [ ]:
#while Loop
i=1
while i<6:
   print(i)
   if (i==5):
     break
   i+=1

1
2
3
4
5

In [ ]:
# Python program to find the L.C.M. of two input numbers

def LCM(x,y):
 if x>y:
  greater=x
 else:
  greater=y
 while(True):
  if ((greater % x==0) and (greater % y==0)):
    lcm=greater
    break
  greater += 1
 return lcm
num1 = int(input("Enter first number: "))
num2 = int(input("Enter second number: "))
print("The LCM of", num1,"and",num2,"is",lcm(num1,num2))

Enter first number: 242
Enter second number: 300
The LCM of 242 and 300 is 36300